function Sanci_main()
%三次参数样条函数构造凸轮及磨削过程展现主函数：Sanci_main()
%tic;
warning off;
global C_ D_x D_y D_n D_L R;
%实现在图形界面用户自行取型值点
% Sanci_XY_axis([3.65,0.05,0.05,1.75,3.8,1.9,-2.5,-1.5]);
%     set(gca,'XTick',-2.5:0.25:4);
%     set(gca,'XTickLabel',{'-2.50','-2.25','-2.00','-1.75','-1.50','1.25','-1.00','-0.75','-0.50','-0.25','0','0.25','0.50','0.75','1.00','1.25','1.50','1.75','2.00','2.25','2.50','2.75','3.00','3.25','3.50','3.75','4.00'});
%     set(gca,'YTick',-1.5:0.25:2);
%     set(gca,'YTickLabel',{'-1.50','-1.25','-1.00','-0.75','-0.50','-0.25','0','0.25','0.50','0.75','1.00','1.25','1.50','1.75','2.00'});
%     grid on;         %画网格线
%     title('请合理取任意个型值点按回车键结束取点','fontsize',20,'fontweight','bold','fontname','华文行楷');
% [D_x,D_y]=ginput;     %ginput取点函数说明：得到的点的维坐标值分别用列向量存储！！！
% D_x=D_x';          
% D_y=D_y';             %将型值点的二维坐标存储转置为行向量存储
% D_=[D_x;D_y];
% fid=fopen('Sanci_XZD.txt', 'wt');  
% fprintf(fid, '(%-8.4f,%8.4f)\n',D_);
% fclose(fid);
% clear D_
% close all;
% clc;
R=0.1;
% D_x = [0.64   0.15   -0.24   -0.46   -0.47   -0.29   0.04   0.31   0.86   0.64];
% D_y = [0.4   0.48   0.38    0.21    -0.16   -0.38   -0.47   -0.48   -0.29   0.4];
% D_x=[0,-0.15,-0.30,-0.43,-0.48,-0.48,-0.45,-0.4,-0.3,-0.15,0,0.17,0.31,0.49,0.64,0.83,0.94,1.01,1.03,1.02,0.98,0.92,0.86,0.75,0.64,0.50,0.39,0.28,0.17,0];   %29+1个点
% D_y=[0.46,0.42,0.35,0.25,0.12,-0.06,-0.22,-0.31,-0.39,-0.44,-0.47,-0.485,-0.48,-0.45,-0.41,-0.33,-0.24,-0.14,-0.05,0.07,0.17,0.25,0.3,0.35,0.40,0.44,0.47,0.48,0.48,0.46];

D_x=[0,-0.06,-0.10,-0.15,-0.30,-0.43,-0.48,-0.48,-0.45,-0.4,-0.3,-0.15,0,0.17,0.31,0.49,0.64,0.83,0.94,1.01,1.03,1.02,0.98,0.92,0.86,0.75,0.64,0.50,0.39,0.28,0.17,0.12,0.05,0];   %33+1个点
D_y=[0.46,0.44,0.43,0.42,0.35,0.25,0.12,-0.06,-0.22,-0.31,-0.39,-0.44,-0.47,-0.485,-0.48,-0.45,-0.41,-0.33,-0.24,-0.14,-0.05,0.07,0.17,0.25,0.3,0.35,0.40,0.44,0.47,0.48,0.48,0.47,0.465,0.46];

%%%%%%%%%%%%%%%%%%%%%%%%%%%%搞笑的
% load('SZ_XZD.mat');
% D_x = XZD_X/25;
% D_y = XZD_Y/25;
% clear XZD_X XZD_Y;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%有错误
% fid = fopen('Sanci_XZD.txt','r');
% s = fscanf(fid,'%*c%f %*c  %f%*c ',[2 inf]);     
% fclose(fid);
% D_x = s(1,:);
% D_y = s(2,:);

% 这是对称棱角凸轮
% D_x=[30.00,28.55,25.00,20.00,15.00,10.00,0.00,-5.00,-10.00,-12.50,-15.00,-17.00,-19.00,-20.00, -19.00,-17.00,-15.00,-12.50,-10.00,-5.00,0.00, 10.00,15.00,20.00,25.00,28.55,30.00]/25;	%26+1个型值点
% D_y=[0.00,5.00,9.85,12.50,15.00,17.05,20.00,19.05,17.00,15.00,12.50,10.00,5.00,0.00,-5.00,-10.00,-12.50,-15.00,-17.00,-19.05,-19.95, -17.05,-15.00,-12.50,-9.85,-5.00,0.00]/25;

D_n=length(D_x);  %获取型值点个数 n+1个
D_L=0;
fprintf('您选定的的%d个型值点的坐标依次为：\n',D_n)
%disp([D_x;D_y]);
for i=1:1:D_n
    fprintf('(x%d,y%d)=(%-7.3f,%7.3f)  ',i-1,i-1,20*D_x(i),20*D_y(i))   %显示的数据扩大了20倍
    if(rem(i,4)==0)
        fprintf('\n')    %每5个型值点坐标输出为一行,到第5个点输出回车换行符
    end
end         %这个for循环是非必要的，根据不同情况可能有改进空间
fprintf('\n');
fprintf('您选定的砂轮半径信息：R=%d\n',R);
disp('请按任意键继续执行程序......');
pause();
%获取三次参数样条函数的求解，放在C_矩阵中
C_=Sanci_XC(D_x,D_y,D_n,D_L);
%保存三次参数样条函数信息到“SanciCF.txt”文档
fid=fopen('Sanci_CF.txt', 'wt');  
fprintf(fid, '三次参数样条函数系数：\n\t\t\t\tA=%-8.4f,B=%-8.4f,C=%-8.4f,D=%-8.4f\n\t\t\t\tE=%-8.4f,F=%-8.4f,G=%-8.4f,P=%-8.4f\n',C_);
fclose(fid);
%凸轮砂轮磨削画图
Sanci_Picture(C_,D_x,D_y,D_n,D_L,R);
disp('凸轮磨砂轮磨任务MATLAB仿真模拟程序运行已结束！相关数据信息请查看文件“TS_DATAS1.txt”和“TS_DATAS2.txt”，谢谢使用！！')
%close all;
%toc;
return;