function  PICTURE(Theta1,b,c,r)
global b c r Theta1;
%clf清除当前画图窗口；
%画三个圆：已知圆心坐标，半径，利用参数方程求解X（），Y（）
%然后利用plot（X,Y,’’）命令画图；
%圆O1：圆心（0，0），半径r(1)=R1;
%圆O2：圆心（O2x,O2y）,半径r(2)=R2;
%圆O3：圆心（b,0）,半径r(3)=R3;
ap_Theta1=Theta1;         
%保留Theta1的值,便于复原！更重要的是使main里面的for循环正常执行！！！
Theta1=deg2rad(Theta1);  %main函数传进来的Theta1为角度值！！！转换为弧度！！
O2x=c*cos(Theta1);
O2y=c*sin(Theta1);        %求解圆O2的圆心X-Z坐标
Theta1=ap_Theta1;         %Theta1还原
clf                       %清除当前画图窗口 
%下面画出X-O-Y直角坐标系,其中的参数需根据实际情况调试
%对于坐标范围([-30:?:100],[-40:?:40])，经过测试取用下面的参数较合适
clc;
XY_axis([97,1,1,37,100,40,-30,-40]); 
set(gca,'XTick',-30:5:100);
set(gca,'XTickLabel',{'-30.0','-25.0','-20.0','-15.0','-10.0','-5.0','0','5.0','10.0','15.0','20.0','25.0','30.0','35.0','40.0','45.0','50.0','55.0','60.0','65.0','70.0','75.0','80.0','85.0','90.0','95.0','100.0'});
set(gca,'YTick',-40:5:40);
set(gca,'YTickLabel',{'-40.0','-35.0','-30.0','-25.0','-20.0','-15.0','-10.0','-5.0','0','5.0','10.0','15.0','20.0','25.0','30.0','35.0','40.0'});
grid on;         %画网格线
title('曲轴磨削任务动态仿真','fontsize',20,'fontweight','bold','fontname','华文行楷');

t1=0:0.01:360;
X1=r(1)*cos(t1);
Y1=r(1)*sin(t1);
plot(X1,Y1,':k');         %画圆O1
clear X1 Y1; 

X1=-0.8:0.05:0.8;
Y1=X1-X1;
    %Y1=X1;
plot(X1,Y1,':k.');
Y1=-0.8:0.05:0.8;
    %X1=-Y1;
X1=Y1-Y1;
plot(X1,Y1,':k.');        %画圆O1圆心小十字     
clear X1 Y1;
    
t2=0:0.01:360;
X2=O2x+r(2)*cos(t2);
Y2=O2y+r(2)*sin(t2);
plot(X2,Y2,'-m');         %在同一画图窗口画圆O2
clear X2 Y2;

X2=(O2x-1):0.05:(O2x+1);
Y2=X2-X2+O2y;
    %Y2=X2+O2y-O2x;
plot(X2,Y2,'-m');
Y2=(O2y-1):0.05:(O2y+1);
X2=Y2-Y2+O2x;
    %X2=-Y2+O2y+O2x;
plot(X2,Y2,'-m');         %在同一画图窗口画圆O2圆心小十字
clear X2 Y2;               %保持圆O2图形不变

t3=0:0.01:360;
X3=b+r(3)*cos(t3);
Y3=r(3)*sin(t3);
plot(X3,Y3,'-b');         %在同一画图窗口画圆O3
clear X3 Y3;

X3=(b-1):0.05:(b+1);
Y3=X3-X3;
    %Y3=X3-b;
plot(X3,Y3,'-b.');
Y3=-1:0.05:1;
X3=Y3-Y3+b;
    %X3=-Y3+b;
plot(X3,Y3,'-b.');
clear X3 Y3;
pause(0.000001)                   %停顿0.000001秒